renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8E1AF.h
        struct
        {
            __IOM uint32_t ICAFA : 1;  /*!< [0..0] Forwarding GTCCRA register Compare Match/Input Capture
                                        *   to Other Channel GTCCRA Input Capture Source Enable                       */
            __IOM uint32_t ICAFB : 1;  /*!< [1..1] Forwarding GTCCRB register Compare Match/Input Capture
                                        *   to Other Channel GTCCRA Input Capture Source Enable                       */
            __IOM uint32_t ICAFC : 1;  /*!< [2..2] Forwarding GTCCRC register Compare Match Capture to Other
                                        *   Channel GTCCRA Input Capture Source Enable                                */
            __IOM uint32_t ICAFD : 1;  /*!< [3..3] Forwarding GTCCRD register Compare Match Capture to Other
                                        *   Channel GTCCRA Input Capture Source Enable                                */
            __IOM uint32_t ICAFE : 1;  /*!< [4..4] Forwarding GTCCRE register Compare Match Capture to Other
                                        *   Channel GTCCRA Input Capture Source Enable                                */
            __IOM uint32_t ICAFF : 1;  /*!< [5..5] Forwarding GTCCRF register Compare Match Capture to Other
                                        *   Channel GTCCRA Input Capture Source Enable                                */
            __IOM uint32_t ICAFPO : 1; /*!< [6..6] Forwarding Overflow to Other Channel GTCCRA Input Capture
                                        *   Source Enable                                                             */
            __IOM uint32_t ICAFPU : 1; /*!< [7..7] Forwarding Underflow to Other Channel GTCCRA Input Capture
                                        *   Source Enable                                                             */
            __IOM uint32_t ICACLK : 1; /*!< [8..8] Forwarding Count Clock to Other Channel GTCCRA Input
                                        *   Capture Source Enable                                                     */
            uint32_t              : 5;
            __IOM uint32_t ICAGRP : 2; /*!< [15..14] GTCCRA Input Capture Group Select                                */
            __IOM uint32_t ICBFA  : 1; /*!< [16..16] Forwarding GTCCRA register Compare Match/Input Capture
                                        *   to Other Channel GTCCRB Input Capture Source Enable                       */
            __IOM uint32_t ICBFB : 1;  /*!< [17..17] Forwarding GTCCRB register Compare Match/Input Capture
                                        *   to Other Channel GTCCRB Input Capture Source Enable                       */
            __IOM uint32_t ICBFC : 1;  /*!< [18..18] Forwarding GTCCRC register Compare Match Capture to
                                        *   Other Channel GTCCRB Input Capture Source Enable                          */
            __IOM uint32_t ICBFD : 1;  /*!< [19..19] Forwarding GTCCRD register Compare Match Capture to
                                        *   Other Channel GTCCRB Input Capture Source Enable                          */
            __IOM uint32_t ICBFE : 1;  /*!< [20..20] Forwarding GTCCRE register Compare Match Capture to
                                        *   Other Channel GTCCRb Input Capture Source Enable                          */
            __IOM uint32_t ICBFF : 1;  /*!< [21..21] Forwarding GTCCRF register Compare Match Capture to
                                        *   Other Channel GTCCRB Input Capture Source Enable                          */
            __IOM uint32_t ICBFPO : 1; /*!< [22..22] Forwarding Overflow to Other Channel GTCCRB Input Capture
                                        *   Source Enable                                                             */
            __IOM uint32_t ICBFPU : 1; /*!< [23..23] Forwarding Underflow to Other Channel GTCCRB Input
                                        *   Capture Source Enable                                                     */
            __IOM uint32_t ICBCLK : 1; /*!< [24..24] Forwarding Count Clock to Other Channel GTCCRB Input
                                        *   Capture Source Enable                                                     */
            uint32_t              : 5;
            __IOM uint32_t ICBGRP : 2; /*!< [31..30] GTCCRB Input Capture Group Select                                */
        } GTICCR_b;
    };
} R_GPT0_Type;                         /*!< Size = 240 (0xf0)                                                         */

/* =========================================================================================================================== */
/* ================                                        R_GPT_POEG0                                        ================ */
/* =========================================================================================================================== */

/**
 * @brief Port Output Enable for GPT (R_GPT_POEG0)
 */

typedef struct                         /*!< (@ 0x40212000) R_GPT_POEG0 Structure                                      */
{
    union
    {
        __IOM uint32_t POEGG;          /*!< (@ 0x00000000) POEG Group Setting Register                                */

        struct
        {
            __IOM uint32_t PIDF  : 1;  /*!< [0..0] Port Input Detection Flag                                          */
            __IOM uint32_t IOCF  : 1;  /*!< [1..1] Real Time Overcurrent Detection Flag                               */
            __IOM uint32_t OSTPF : 1;  /*!< [2..2] Oscillation Stop Detection Flag                                    */
            __IOM uint32_t SSF   : 1;  /*!< [3..3] Software Stop Flag                                                 */
            __IOM uint32_t PIDE  : 1;  /*!< [4..4] Port Input Detection Enable. Note: Can be modified only
                                        *   once after a reset.                                                       */
            __IOM uint32_t IOCE : 1;   /*!< [5..5] Enable for GPT Output-Disable Request. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t OSTPE : 1;  /*!< [6..6] Oscillation Stop Detection Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            uint32_t             : 1;
            __IOM uint32_t CDRE0 : 1;  /*!< [8..8] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE1 : 1;  /*!< [9..9] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE2 : 1;  /*!< [10..10] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE3 : 1;  /*!< [11..11] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE4 : 1;  /*!< [12..12] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE5 : 1;  /*!< [13..13] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            uint32_t            : 2;
            __IM uint32_t ST    : 1;   /*!< [16..16] GTETRG Input Status Flag                                         */
            uint32_t            : 11;
            __IOM uint32_t INV  : 1;   /*!< [28..28] GTETRG Input Reverse                                             */
            __IOM uint32_t NFEN : 1;   /*!< [29..29] Noise Filter Enable                                              */
            __IOM uint32_t NFCS : 2;   /*!< [31..30] Noise Filter Clock Select                                        */
        } POEGG_b;
    };
    __IM uint32_t RESERVED[15];

    union
    {
        __IOM uint16_t GTONCWP;        /*!< (@ 0x00000040) GPT Output Stopping Control Group Write Protection
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t WP    : 1;  /*!< [0..0] Register Writing Disable                                           */
            uint16_t             : 7;
            __IOM uint16_t PRKEY : 8;  /*!< [15..8] Key Code                                                          */
        } GTONCWP_b;
    };
    __IM uint16_t RESERVED1;

    union
    {
        __IOM uint16_t GTONCCR;        /*!< (@ 0x00000044) GPT Output Stopping Control Group Controlling
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t NE  : 1;    /*!< [0..0] Direct Stopping Request Setting                                    */
            uint16_t           : 3;
            __IOM uint16_t NFS : 4;    /*!< [7..4] Direct Stopping Request Selection                                  */
            __IOM uint16_t NFV : 1;    /*!< [8..8] Direct Stopping Request Active Sense                               */
            uint16_t           : 7;
        } GTONCCR_b;
    };
    __IM uint16_t RESERVED2;
} R_GPT_POEG0_Type;                    /*!< Size = 72 (0x48)                                                          */

/* =========================================================================================================================== */
/* ================                                           R_ICU                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Interrupt Controller Unit (R_ICU)
 */

typedef struct                         /*!< (@ 0x40006000) R_ICU Structure                                            */
{
    union
    {
        __IOM uint8_t IRQCR[16];       /*!< (@ 0x00000000) IRQ Control Register [0..15]                               */

        struct
        {
            __IOM uint8_t IRQMD   : 2; /*!< [1..0] IRQ Detection Sense Select                                         */
            uint8_t               : 2;
            __IOM uint8_t FCLKSEL : 2; /*!< [5..4] IRQ Digital Filter Sampling Clock Select                           */
            uint8_t               : 1;
            __IOM uint8_t FLTEN   : 1; /*!< [7..7] IRQ Digital Filter Enable                                          */
        } IRQCR_b[16];
    };

    union
    {
        __IM uint8_t NMICR;             /*!< (@ 0x00000010) NMI Pin Interrupt Control Register                         */

        struct
        {
            __IOM uint8_t NMIMD    : 1; /*!< [0..0] NMI Detection Set                                                  */
            uint8_t                : 3;
            __IOM uint8_t NFCLKSEL : 2; /*!< [5..4] NMI Digital Filter Sampling Clock                                  */
            uint8_t                : 1;
            __IOM uint8_t NFLTEN   : 1; /*!< [7..7] NMI Digital Filter Enable                                          */
        } NMICR_b;
    };
    __IM uint8_t  RESERVED;
    __IM uint16_t RESERVED1;
    __IM uint32_t RESERVED2[6143];

    union
    {
        __IOM uint8_t SWIRQ_S;         /*!< (@ 0x00006010) Software Interrupt Request Register for Secure
                                        *                  Interrupt                                                  */

        struct
        {
            __IOM uint8_t SWIRQS : 1;  /*!< [0..0] Generates an interrupt for the other CPU subsystem.                */
            uint8_t              : 7;
        } SWIRQ_S_b;
    };
    __IM uint8_t  RESERVED3;
    __IM uint16_t RESERVED4;
    __IM uint32_t RESERVED5[3];

    union
    {
        __IOM uint8_t SWIRQ_NS;        /*!< (@ 0x00006020) Software Interrupt Request Register for Non-secure
                                        *                  Interrupt                                                  */

        struct
        {
            __IOM uint8_t SWIRQNS : 1; /*!< [0..0] Generates an interrupt for the other CPU subsystem.                */
            uint8_t               : 7;
        } SWIRQ_NS_b;
    };
    __IM uint8_t  RESERVED6;
    __IM uint16_t RESERVED7;
    __IM uint32_t RESERVED8[15];

    union
    {
        __IOM uint16_t IENMIER;        /*!< (@ 0x00006060) Integrated Error NMI Interrupt Enable Registe
                                        *                  for CPU                                                    */

        struct
        {
            __IOM uint16_t CMEN  : 1;  /*!< [0..0] Integrated Common Memory error nmi Enable                          */
            __IOM uint16_t LMEN  : 1;  /*!< [1..1] Integrated Local Memory error nmi Enable                           */
            __IOM uint16_t BUSEN : 1;  /*!< [2..2] Integrated BUS error nmi Enable                                    */
            uint16_t             : 13;
        } IENMIER_b;
    };
    __IM uint16_t RESERVED9;
    __IM uint32_t RESERVED10[39];

    union
    {
        __IOM uint16_t NMIER;          /*!< (@ 0x00006100) Non-Maskable Interrupt Enable Register                     */

        struct
        {
            __IOM uint16_t IWDTEN : 1; /*!< [0..0] IWDT Underflow/Refresh Error Interrupt Enable                      */
            __IOM uint16_t WDTEN  : 1; /*!< [1..1] WDT Underflow/Refresh Error Interrupt Enable                       */
            __IOM uint16_t LVD1EN : 1; /*!< [2..2] Voltage-Monitoring 1 Interrupt Enable                              */
            __IOM uint16_t LVD2EN : 1; /*!< [3..3] Voltage-Monitoring 2 Interrupt Enable                              */
            uint16_t              : 2;
            __IOM uint16_t OSTEN  : 1; /*!< [6..6] Oscillation Stop Detection Interrupt Enable                        */
            __IOM uint16_t NMIEN  : 1; /*!< [7..7] NMI Pin Interrupt Enable                                           */
            uint16_t              : 4;
            __IOM uint16_t BUSEN  : 1; /*!< [12..12] BUS error Interrupt Enable                                       */
            __IOM uint16_t CMEN   : 1; /*!< [13..13] Common Memory error Interrupt Enable                             */
            uint16_t              : 1;
            __IOM uint16_t LUEN   : 1; /*!< [15..15] LockUp Interrupt Enable                                          */
        } NMIER_b;
    };
    __IM uint16_t RESERVED11;
    __IM uint32_t RESERVED12[3];

    union
    {
        __IOM uint16_t NMICLR;          /*!< (@ 0x00006110) Non-Maskable Interrupt Status Clear Register               */

        struct
        {
            __IOM uint16_t IWDTCLR : 1; /*!< [0..0] IWDT Clear                                                         */
            __IOM uint16_t WDTCLR  : 1; /*!< [1..1] WDT Clear                                                          */
            __IOM uint16_t LVD1CLR : 1; /*!< [2..2] PVD1 Clear                                                         */
            __IOM uint16_t LVD2CLR : 1; /*!< [3..3] PVD2 Clear                                                         */
            uint16_t               : 2;
            __IOM uint16_t OSTCLR  : 1; /*!< [6..6] OST Clear                                                          */
            __IOM uint16_t NMICLR  : 1; /*!< [7..7] NMI Clear                                                          */
            uint16_t               : 4;
            __IOM uint16_t BUSCLR  : 1; /*!< [12..12] Bus Clear                                                        */
            __IOM uint16_t CMCLR   : 1; /*!< [13..13] CM Clear                                                         */
            uint16_t               : 1;
            __IOM uint16_t LUCLR   : 1; /*!< [15..15] LU Clear                                                         */
        } NMICLR_b;
    };
    __IM uint16_t RESERVED13;
    __IM uint32_t RESERVED14[3];

    union
    {
        __IM uint16_t NMISR;           /*!< (@ 0x00006120) Non-Maskable Interrupt Status Register                     */

        struct
        {
            __IM uint16_t IWDTST : 1;  /*!< [0..0] IWDT Underflow/Refresh Error Status Flag                           */
            __IM uint16_t WDTST  : 1;  /*!< [1..1] WDT Underflow/Refresh Error Status Flag                            */
            __IM uint16_t LVD1ST : 1;  /*!< [2..2] Voltage-Monitoring 1 Interrupt Status Flag                         */
            __IM uint16_t LVD2ST : 1;  /*!< [3..3] Voltage-Monitoring 2 Interrupt Status Flag                         */
            uint16_t             : 2;
            __IM uint16_t OSTST  : 1;  /*!< [6..6] Oscillation Stop Detection Interrupt Status Flag                   */
            __IM uint16_t NMIST  : 1;  /*!< [7..7] NMI Status Flag                                                    */
            uint16_t             : 4;
            __IM uint16_t BUSST  : 1;  /*!< [12..12] BUS error Interrupt Status Flag                                  */
            __IM uint16_t CMST   : 1;  /*!< [13..13] Common Memory error Interrupt Status Flag                        */
            uint16_t             : 1;
            __IM uint16_t LUST   : 1;  /*!< [15..15] LockUp Interrupt Status Flag                                     */
        } NMISR_b;
    };
    __IM uint16_t RESERVED15;
    __IM uint32_t RESERVED16[31];

    union
    {
        __IOM uint32_t WUPEN;               /*!< (@ 0x000061A0) Wake Up Interrupt Enable Register                          */

