renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8E1AF.h
        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR0_b;
    };

    union
    {
        __IOM uint8_t VBTBKR1;         /*!< (@ 0x00000D01) VBATT Backup Register 1                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR1_b;
    };

    union
    {
        __IOM uint8_t VBTBKR2;         /*!< (@ 0x00000D02) VBATT Backup Register 2                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR2_b;
    };

    union
    {
        __IOM uint8_t VBTBKR3;         /*!< (@ 0x00000D03) VBATT Backup Register 3                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR3_b;
    };

    union
    {
        __IOM uint8_t VBTBKR4;         /*!< (@ 0x00000D04) VBATT Backup Register 4                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR4_b;
    };

    union
    {
        __IOM uint8_t VBTBKR5;         /*!< (@ 0x00000D05) VBATT Backup Register 5                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR5_b;
    };

    union
    {
        __IOM uint8_t VBTBKR6;         /*!< (@ 0x00000D06) VBATT Backup Register 6                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR6_b;
    };

    union
    {
        __IOM uint8_t VBTBKR7;         /*!< (@ 0x00000D07) VBATT Backup Register 7                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR7_b;
    };

    union
    {
        __IOM uint8_t VBTBKR8;         /*!< (@ 0x00000D08) VBATT Backup Register 8                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR8_b;
    };

    union
    {
        __IOM uint8_t VBTBKR9;         /*!< (@ 0x00000D09) VBATT Backup Register 9                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR9_b;
    };

    union
    {
        __IOM uint8_t VBTBKR10;        /*!< (@ 0x00000D0A) VBATT Backup Register 10                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR10_b;
    };

    union
    {
        __IOM uint8_t VBTBKR11;        /*!< (@ 0x00000D0B) VBATT Backup Register 11                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR11_b;
    };

    union
    {
        __IOM uint8_t VBTBKR12;        /*!< (@ 0x00000D0C) VBATT Backup Register 12                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR12_b;
    };

    union
    {
        __IOM uint8_t VBTBKR13;        /*!< (@ 0x00000D0D) VBATT Backup Register 13                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR13_b;
    };

    union
    {
        __IOM uint8_t VBTBKR14;        /*!< (@ 0x00000D0E) VBATT Backup Register 14                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR14_b;
    };

    union
    {
        __IOM uint8_t VBTBKR15;        /*!< (@ 0x00000D0F) VBATT Backup Register 15                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR15_b;
    };

    union
    {
        __IOM uint8_t VBTBKR16;        /*!< (@ 0x00000D10) VBATT Backup Register 16                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR16_b;
    };

    union
    {
        __IOM uint8_t VBTBKR17;        /*!< (@ 0x00000D11) VBATT Backup Register 17                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR17_b;
    };

    union
    {
        __IOM uint8_t VBTBKR18;        /*!< (@ 0x00000D12) VBATT Backup Register 18                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR18_b;
    };

    union
    {
        __IOM uint8_t VBTBKR19;        /*!< (@ 0x00000D13) VBATT Backup Register 19                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR19_b;
    };

    union
    {
        __IOM uint8_t VBTBKR20;        /*!< (@ 0x00000D14) VBATT Backup Register 20                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR20_b;
    };

    union
    {
        __IOM uint8_t VBTBKR21;        /*!< (@ 0x00000D15) VBATT Backup Register 21                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR21_b;
    };

    union
    {
        __IOM uint8_t VBTBKR22;        /*!< (@ 0x00000D16) VBATT Backup Register 22                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR22_b;
    };

    union
    {
        __IOM uint8_t VBTBKR23;        /*!< (@ 0x00000D17) VBATT Backup Register 23                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR23_b;
    };

    union
    {
        __IOM uint8_t VBTBKR24;        /*!< (@ 0x00000D18) VBATT Backup Register 24                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR24_b;
    };

    union
    {
        __IOM uint8_t VBTBKR25;        /*!< (@ 0x00000D19) VBATT Backup Register 25                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR25_b;
    };

    union
    {
        __IOM uint8_t VBTBKR26;        /*!< (@ 0x00000D1A) VBATT Backup Register 26                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR26_b;
    };

    union
    {
        __IOM uint8_t VBTBKR27;        /*!< (@ 0x00000D1B) VBATT Backup Register 27                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR27_b;
    };

    union
    {
        __IOM uint8_t VBTBKR28;        /*!< (@ 0x00000D1C) VBATT Backup Register 28                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR28_b;
    };

    union
    {
        __IOM uint8_t VBTBKR29;        /*!< (@ 0x00000D1D) VBATT Backup Register 29                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR29_b;
    };

    union
    {
        __IOM uint8_t VBTBKR30;        /*!< (@ 0x00000D1E) VBATT Backup Register 30                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR30_b;
    };

    union
    {
        __IOM uint8_t VBTBKR31;        /*!< (@ 0x00000D1F) VBATT Backup Register 31                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR31_b;
    };

    union
    {
        __IOM uint8_t VBTBKR32;        /*!< (@ 0x00000D20) VBATT Backup Register 32                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR32_b;
    };

    union
    {
        __IOM uint8_t VBTBKR33;        /*!< (@ 0x00000D21) VBATT Backup Register 33                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR33_b;
    };

    union
    {
        __IOM uint8_t VBTBKR34;        /*!< (@ 0x00000D22) VBATT Backup Register 34                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR34_b;
    };

    union
    {
        __IOM uint8_t VBTBKR35;        /*!< (@ 0x00000D23) VBATT Backup Register 35                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR35_b;
    };

    union
    {
        __IOM uint8_t VBTBKR36;        /*!< (@ 0x00000D24) VBATT Backup Register 36                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR36_b;
    };

    union
    {
        __IOM uint8_t VBTBKR37;        /*!< (@ 0x00000D25) VBATT Backup Register 37                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR37_b;
    };

    union
    {
        __IOM uint8_t VBTBKR38;        /*!< (@ 0x00000D26) VBATT Backup Register 38                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR38_b;
    };

    union
    {
        __IOM uint8_t VBTBKR39;        /*!< (@ 0x00000D27) VBATT Backup Register 39                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR39_b;
    };

    union
    {
        __IOM uint8_t VBTBKR40;        /*!< (@ 0x00000D28) VBATT Backup Register 40                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR40_b;
    };

    union
    {
        __IOM uint8_t VBTBKR41;        /*!< (@ 0x00000D29) VBATT Backup Register 41                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR41_b;
    };

    union
    {
        __IOM uint8_t VBTBKR42;        /*!< (@ 0x00000D2A) VBATT Backup Register 42                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR42_b;
    };

    union
    {
        __IOM uint8_t VBTBKR43;        /*!< (@ 0x00000D2B) VBATT Backup Register 43                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR43_b;
    };

    union
    {
        __IOM uint8_t VBTBKR44;        /*!< (@ 0x00000D2C) VBATT Backup Register 44                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR44_b;
    };

    union
    {
        __IOM uint8_t VBTBKR45;        /*!< (@ 0x00000D2D) VBATT Backup Register 45                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR45_b;
    };

    union
    {
        __IOM uint8_t VBTBKR46;        /*!< (@ 0x00000D2E) VBATT Backup Register 46                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR46_b;
    };

    union
    {
        __IOM uint8_t VBTBKR47;        /*!< (@ 0x00000D2F) VBATT Backup Register 47                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR47_b;
    };

    union
    {
        __IOM uint8_t VBTBKR48;        /*!< (@ 0x00000D30) VBATT Backup Register 48                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR48_b;
    };

    union
    {
        __IOM uint8_t VBTBKR49;        /*!< (@ 0x00000D31) VBATT Backup Register 49                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR49_b;
    };

    union
    {
        __IOM uint8_t VBTBKR50;        /*!< (@ 0x00000D32) VBATT Backup Register 50                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR50_b;
    };

    union
    {
        __IOM uint8_t VBTBKR51;        /*!< (@ 0x00000D33) VBATT Backup Register 51                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR51_b;
    };

    union
    {
        __IOM uint8_t VBTBKR52;        /*!< (@ 0x00000D34) VBATT Backup Register 52                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR52_b;
    };

    union
    {
        __IOM uint8_t VBTBKR53;        /*!< (@ 0x00000D35) VBATT Backup Register 53                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR53_b;
    };

    union
    {
        __IOM uint8_t VBTBKR54;        /*!< (@ 0x00000D36) VBATT Backup Register 54                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR54_b;
    };

    union
    {
        __IOM uint8_t VBTBKR55;        /*!< (@ 0x00000D37) VBATT Backup Register 55                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR55_b;
    };

    union
    {
        __IOM uint8_t VBTBKR56;        /*!< (@ 0x00000D38) VBATT Backup Register 56                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR56_b;
    };

    union
    {
        __IOM uint8_t VBTBKR57;        /*!< (@ 0x00000D39) VBATT Backup Register 57                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR57_b;
    };

    union
    {
        __IOM uint8_t VBTBKR58;        /*!< (@ 0x00000D3A) VBATT Backup Register 58                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR58_b;
    };

    union
    {
        __IOM uint8_t VBTBKR59;        /*!< (@ 0x00000D3B) VBATT Backup Register 59                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR59_b;
    };

    union
    {
        __IOM uint8_t VBTBKR60;        /*!< (@ 0x00000D3C) VBATT Backup Register 60                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR60_b;
    };

    union
    {
        __IOM uint8_t VBTBKR61;        /*!< (@ 0x00000D3D) VBATT Backup Register 61                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR61_b;
    };

    union
    {
        __IOM uint8_t VBTBKR62;        /*!< (@ 0x00000D3E) VBATT Backup Register 62                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR62_b;
    };

    union
    {
        __IOM uint8_t VBTBKR63;        /*!< (@ 0x00000D3F) VBATT Backup Register 63                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR63_b;
    };

    union
    {
        __IOM uint8_t VBTBKR64;        /*!< (@ 0x00000D40) VBATT Backup Register 64                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR64_b;
    };

    union
    {
        __IOM uint8_t VBTBKR65;        /*!< (@ 0x00000D41) VBATT Backup Register 65                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR65_b;
    };

    union
    {
        __IOM uint8_t VBTBKR66;        /*!< (@ 0x00000D42) VBATT Backup Register 66                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR66_b;
    };

    union
    {
        __IOM uint8_t VBTBKR67;        /*!< (@ 0x00000D43) VBATT Backup Register 67                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR67_b;
    };

    union
    {
        __IOM uint8_t VBTBKR68;        /*!< (@ 0x00000D44) VBATT Backup Register 68                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR68_b;
    };

    union
    {
        __IOM uint8_t VBTBKR69;        /*!< (@ 0x00000D45) VBATT Backup Register 69                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR69_b;
    };

    union
    {
        __IOM uint8_t VBTBKR70;        /*!< (@ 0x00000D46) VBATT Backup Register 70                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR70_b;
    };

    union
    {
        __IOM uint8_t VBTBKR71;        /*!< (@ 0x00000D47) VBATT Backup Register 71                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR71_b;
    };

    union
    {
        __IOM uint8_t VBTBKR72;        /*!< (@ 0x00000D48) VBATT Backup Register 72                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR72_b;
    };

    union
    {
        __IOM uint8_t VBTBKR73;        /*!< (@ 0x00000D49) VBATT Backup Register 73                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR73_b;
    };

    union
    {
        __IOM uint8_t VBTBKR74;        /*!< (@ 0x00000D4A) VBATT Backup Register 74                                   */

