renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8E1AF.h
        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_b;
    };

    union
    {
        __IOM uint32_t CDBCR2;         /*!< (@ 0x0000009C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_b;
    };

    union
    {
        __IOM uint32_t AXIBUSCTL2;      /*!< (@ 0x000000A0) AXI Bus Control Register 2                                 */

        struct
        {
            __IOM uint32_t AWCACHE : 4; /*!< [3..0] AWCACHE[3:0] Signals for Capture Engine Unit                       */
            uint32_t               : 28;
        } AXIBUSCTL2_b;
    };
    __IM uint32_t RESERVED6[987];

    union
    {
        __IOM uint32_t CAMOR_B;        /*!< (@ 0x00001010) Capture Interface Offset Register                          */

        struct
        {
            __IOM uint32_t HOFST : 13; /*!< [12..0] Specify the capture start location in terms of the number
                                        *   of clock cycles from a horizontal sync signal (1-cycle
                                        *   units).                                                                   */
            uint32_t             : 3;
            __IOM uint32_t VOFST : 12; /*!< [27..16] Specify the capture start location in terms of the
                                        *   HD count from a vertical sync signal (1-HD units).                        */
            uint32_t : 4;
        } CAMOR_B_b;
    };

    union
    {
        __IOM uint32_t CAPWR_B;        /*!< (@ 0x00001014) Capture Interface Width Register                           */

        struct
        {
            __IOM uint32_t HWDTH : 13; /*!< [12..0] Specify the horizontal capture period.                            */
            uint32_t             : 3;
            __IOM uint32_t VWDTH : 12; /*!< [27..16] Specify the vertical capture period (4-HD units).                */
            uint32_t             : 4;
        } CAPWR_B_b;
    };
    __IM uint32_t RESERVED7[6];

    union
    {
        __IOM uint32_t CFLCR_B;        /*!< (@ 0x00001030) Capture Filter Control Register                            */

        struct
        {
            __IOM uint32_t HFRAC : 12; /*!< [11..0] Fraction Part of Horizontal Scale-Down Factor                     */
            __IOM uint32_t HMANT : 4;  /*!< [15..12] Mantissa Part of Horizontal Scale-Down Factor                    */
            __IOM uint32_t VFRAC : 12; /*!< [27..16] Fraction Part of Vertical Scale-Down Factor                      */
            __IOM uint32_t VMANT : 4;  /*!< [31..28] Mantissa Part of Vertical Scale-Down Factor                      */
        } CFLCR_B_b;
    };

    union
    {
        __IOM uint32_t CFSZR_B;        /*!< (@ 0x00001034) Capture Filter Size Clip Register                          */

        struct
        {
            __IOM uint32_t HFCLP : 12; /*!< [11..0] Specify the horizontal clipping value of the filter
                                        *   output size (4-pixel units).                                              */
            uint32_t             : 4;
            __IOM uint32_t VFCLP : 12; /*!< [27..16] Set the vertical clipping value of the filter output
                                        *   size (4-pixel units).                                                     */
            uint32_t : 4;
        } CFSZR_B_b;
    };

    union
    {
        __IOM uint32_t CDWDR_B;        /*!< (@ 0x00001038) Capture Destination Width Register                         */

        struct
        {
            __IOM uint32_t CHDW : 13;  /*!< [12..0] Specify the horizontal image size in the memory area
                                        *   where the captured image is to be stored (4-byte units).                  */
            uint32_t : 19;
        } CDWDR_B_b;
    };

    union
    {
        __IOM uint32_t CDAYR_B;        /*!< (@ 0x0000103C) Capture Data Address Y Register                            */

        struct
        {
            __IOM uint32_t CAYR : 32;  /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR_B_b;
    };

    union
    {
        __IOM uint32_t CDACR_B;        /*!< (@ 0x00001040) Capture Data Address C Register                            */

        struct
        {
            __IOM uint32_t CACR : 32;  /*!< [31..0] Capture Data Address C                                            */
        } CDACR_B_b;
    };

    union
    {
        __IOM uint32_t CDBYR_B;        /*!< (@ 0x00001044) Capture Data Bottom-Field Address Y Register               */

        struct
        {
            __IOM uint32_t CBYR : 32;  /*!< [31..0] Set the address for storing the Y (luminance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBYR_B_b;
    };

    union
    {
        __IOM uint32_t CDBCR_B;        /*!< (@ 0x00001048) Capture Data Bottom-Field Address C Register               */

        struct
        {
            __IOM uint32_t CBCR : 32;  /*!< [31..0] Set the address for storing the C (chrominance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBCR_B_b;
    };

    union
    {
        __IOM uint32_t CBDSR_B;        /*!< (@ 0x0000104C) Capture Bundle Destination Size Register                   */

        struct
        {
            __IOM uint32_t CBVS : 23;  /*!< [22..0] Select the number of lines or number of bytes for output
                                        *   to the memory in a bundle write.                                          */
            uint32_t : 9;
        } CBDSR_B_b;
    };
    __IM uint32_t RESERVED8[4];

    union
    {
        __IOM uint32_t CLFCR_B;        /*!< (@ 0x00001060) Capture Low-Pass Filter Control Register                   */

        struct
        {
            __IOM uint32_t LPF : 1;    /*!< [0..0] Enables or disables operation of the low-pass filter.              */
            uint32_t           : 31;
        } CLFCR_B_b;
    };

    union
    {
        __IOM uint32_t CDOCR_B;        /*!< (@ 0x00001064) Capture Data Output Control Register                       */

        struct
        {
            __IOM uint32_t COBS : 1;   /*!< [0..0] Controls swapping in 8-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COWS : 1;   /*!< [1..1] Controls swapping in 16-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COLS : 1;   /*!< [2..2] Controls swapping in 32-bit units for data output from
                                        *   the CEU.                                                                  */
            uint32_t           : 1;
            __IOM uint32_t CDS : 1;    /*!< [4..4] Sets the image format when outputting the image data
                                        *   captured in the YCbCr422 format to the memory.                            */
            uint32_t           : 11;
            __IOM uint32_t CBE : 1;    /*!< [16..16] Controls the number of lines of captured data to be
                                        *   written to the memory.                                                    */
            uint32_t : 15;
        } CDOCR_B_b;
    };
    __IM uint32_t RESERVED9[10];

    union
    {
        __IOM uint32_t CDAYR2_B;       /*!< (@ 0x00001090) Capture Data Address Y Register 2                          */

        struct
        {
            __IOM uint32_t CAYR2 : 32; /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR2_B_b;
    };

    union
    {
        __IOM uint32_t CDACR2_B;       /*!< (@ 0x00001094) Capture Data Address C Register 2                          */

        struct
        {
            __IOM uint32_t CACR2 : 32; /*!< [31..0] Capture Data Address C2                                           */
        } CDACR2_B_b;
    };

    union
    {
        __IOM uint32_t CDBYR2_B;       /*!< (@ 0x00001098) Capture Data Bottom-Field Address Y Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_B_b;
    };

    union
    {
        __IOM uint32_t CDBCR2_B;       /*!< (@ 0x0000109C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_B_b;
    };
    __IM uint32_t RESERVED10[988];

    union
    {
        __IOM uint32_t CAMOR_M;        /*!< (@ 0x00002010) Capture Interface Offset Register                          */

        struct
        {
            __IOM uint32_t HOFST : 13; /*!< [12..0] Specify the capture start location in terms of the number
                                        *   of clock cycles from a horizontal sync signal (1-cycle
                                        *   units).                                                                   */
            uint32_t             : 3;
            __IOM uint32_t VOFST : 12; /*!< [27..16] Specify the capture start location in terms of the
                                        *   HD count from a vertical sync signal (1-HD units).                        */
            uint32_t : 4;
        } CAMOR_M_b;
    };

    union
    {
        __IOM uint32_t CAPWR_M;        /*!< (@ 0x00002014) Capture Interface Width Register                           */

        struct
        {
            __IOM uint32_t HWDTH : 13; /*!< [12..0] Specify the horizontal capture period.                            */
            uint32_t             : 3;
            __IOM uint32_t VWDTH : 12; /*!< [27..16] Specify the vertical capture period (4-HD units).                */
            uint32_t             : 4;
        } CAPWR_M_b;
    };
    __IM uint32_t RESERVED11[6];

    union
    {
        __IOM uint32_t CFLCR_M;        /*!< (@ 0x00002030) Capture Filter Control Register                            */

        struct
        {
            __IOM uint32_t HFRAC : 12; /*!< [11..0] Fraction Part of Horizontal Scale-Down Factor                     */
            __IOM uint32_t HMANT : 4;  /*!< [15..12] Mantissa Part of Horizontal Scale-Down Factor                    */
            __IOM uint32_t VFRAC : 12; /*!< [27..16] Fraction Part of Vertical Scale-Down Factor                      */
            __IOM uint32_t VMANT : 4;  /*!< [31..28] Mantissa Part of Vertical Scale-Down Factor                      */
        } CFLCR_M_b;
    };

    union
    {
        __IOM uint32_t CFSZR_M;        /*!< (@ 0x00002034) Capture Filter Size Clip Register                          */

        struct
        {
            __IOM uint32_t HFCLP : 12; /*!< [11..0] Specify the horizontal clipping value of the filter
                                        *   output size (4-pixel units).                                              */
            uint32_t             : 4;
            __IOM uint32_t VFCLP : 12; /*!< [27..16] Set the vertical clipping value of the filter output
                                        *   size (4-pixel units).                                                     */
            uint32_t : 4;
        } CFSZR_M_b;
    };

    union
    {
        __IOM uint32_t CDWDR_M;        /*!< (@ 0x00002038) Capture Destination Width Register                         */

        struct
        {
            __IOM uint32_t CHDW : 13;  /*!< [12..0] Specify the horizontal image size in the memory area
                                        *   where the captured image is to be stored (4-byte units).                  */
            uint32_t : 19;
        } CDWDR_M_b;
    };

    union
    {
        __IOM uint32_t CDAYR_M;        /*!< (@ 0x0000203C) Capture Data Address Y Register                            */

        struct
        {
            __IOM uint32_t CAYR : 32;  /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR_M_b;
    };

    union
    {
        __IOM uint32_t CDACR_M;        /*!< (@ 0x00002040) Capture Data Address C Register                            */

        struct
        {
            __IOM uint32_t CACR : 32;  /*!< [31..0] Capture Data Address C                                            */
        } CDACR_M_b;
    };

    union
    {
        __IOM uint32_t CDBYR_M;        /*!< (@ 0x00002044) Capture Data Bottom-Field Address Y Register               */

        struct
        {
            __IOM uint32_t CBYR : 32;  /*!< [31..0] Set the address for storing the Y (luminance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBYR_M_b;
    };

    union
    {
        __IOM uint32_t CDBCR_M;        /*!< (@ 0x00002048) Capture Data Bottom-Field Address C Register               */

        struct
        {
            __IOM uint32_t CBCR : 32;  /*!< [31..0] Set the address for storing the C (chrominance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBCR_M_b;
    };

    union
    {
        __IOM uint32_t CBDSR_M;        /*!< (@ 0x0000204C) Capture Bundle Destination Size Register                   */

        struct
        {
            __IOM uint32_t CBVS : 23;  /*!< [22..0] Select the number of lines or number of bytes for output
                                        *   to the memory in a bundle write.                                          */
            uint32_t : 9;
        } CBDSR_M_b;
    };
    __IM uint32_t RESERVED12[4];

    union
    {
        __IOM uint32_t CLFCR_M;        /*!< (@ 0x00002060) Capture Low-Pass Filter Control Register                   */

        struct
        {
            __IOM uint32_t LPF : 1;    /*!< [0..0] Enables or disables operation of the low-pass filter.              */
            uint32_t           : 31;
        } CLFCR_M_b;
    };

    union
    {
        __IOM uint32_t CDOCR_M;        /*!< (@ 0x00002064) Capture Data Output Control Register                       */

        struct
        {
            __IOM uint32_t COBS : 1;   /*!< [0..0] Controls swapping in 8-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COWS : 1;   /*!< [1..1] Controls swapping in 16-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COLS : 1;   /*!< [2..2] Controls swapping in 32-bit units for data output from
                                        *   the CEU.                                                                  */
            uint32_t           : 1;
            __IOM uint32_t CDS : 1;    /*!< [4..4] Sets the image format when outputting the image data
                                        *   captured in the YCbCr422 format to the memory.                            */
            uint32_t           : 11;
            __IOM uint32_t CBE : 1;    /*!< [16..16] Controls the number of lines of captured data to be
                                        *   written to the memory.                                                    */
            uint32_t : 15;
        } CDOCR_M_b;
    };
    __IM uint32_t RESERVED13[10];

    union
    {
        __IOM uint32_t CDAYR2_M;       /*!< (@ 0x00002090) Capture Data Address Y Register 2                          */

        struct
        {
            __IOM uint32_t CAYR2 : 32; /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR2_M_b;
    };

    union
    {
        __IOM uint32_t CDACR2_M;       /*!< (@ 0x00002094) Capture Data Address C Register 2                          */

        struct
        {
            __IOM uint32_t CACR2 : 32; /*!< [31..0] Capture Data Address C2                                           */
        } CDACR2_M_b;
    };

    union
    {
        __IOM uint32_t CDBYR2_M;       /*!< (@ 0x00002098) Capture Data Bottom-Field Address Y Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_M_b;
    };

    union
    {
        __IOM uint32_t CDBCR2_M;       /*!< (@ 0x0000209C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_M_b;
    };
} R_CEU_Type;                          /*!< Size = 8352 (0x20a0)                                                      */

/* =========================================================================================================================== */
/* ================                                          R_ULPT0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Ultra-Low Power Timer 0 (R_ULPT0)
 */

typedef struct                           /*!< (@ 0x40220000) R_ULPT0 Structure                                          */
{
    union
    {
        __IOM uint32_t ULPTCNT;          /*!< (@ 0x00000000) ULPT Counter Register                                      */

        struct
        {
            __IOM uint32_t ULPTCNT : 32; /*!< [31..0] 32bit counter and reload registerNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, the 32-bit counter
                                          *   is forcibly stopped and set to FFFFFFFFH.                                 */
        } ULPTCNT_b;
    };

    union
    {
        __IOM uint32_t ULPTCMA;          /*!< (@ 0x00000004) ULPT Compare Match A Register                              */

        struct
        {
            __IOM uint32_t ULPTCMA : 32; /*!< [31..0] ULPT Compare Match A RegisterNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, set to FFFFFFFFH                 */
        } ULPTCMA_b;
    };

    union
    {
        __IOM uint32_t ULPTCMB;          /*!< (@ 0x00000008) ULPT Compare Match B Register                              */

        struct
        {
            __IOM uint32_t ULPTCMB : 32; /*!< [31..0] AGT Compare Match B RegisterNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, set to FFFFFFFFH                 */
        } ULPTCMB_b;
    };

    union
    {
        __IOM uint8_t ULPTCR;          /*!< (@ 0x0000000C) ULPT Control Register                                      */

        struct
        {
            __IOM uint8_t TSTART : 1;  /*!< [0..0] ULPT count start                                                   */
            __IM uint8_t  TCSTF  : 1;  /*!< [1..1] ULPT count status flag                                             */
            __OM uint8_t  TSTOP  : 1;  /*!< [2..2] ULPT count forced stop                                             */
            uint8_t              : 2;
            __IOM uint8_t TUNDF  : 1;  /*!< [5..5] ULPT underflow flag                                                */
            __IOM uint8_t TCMAF  : 1;  /*!< [6..6] ULPT compare match A flag                                          */
            __IOM uint8_t TCMBF  : 1;  /*!< [7..7] ULPT compare match B flag                                          */
        } ULPTCR_b;
    };

    union
    {
        __IOM uint8_t ULPTMR1;         /*!< (@ 0x0000000D) ULPT Mode Register 1                                       */

        struct
        {
            uint8_t              : 1;
            __IOM uint8_t TMOD1  : 1;  /*!< [1..1] ULPT operating mode select                                         */
            uint8_t              : 1;
            __IOM uint8_t TEDGPL : 1;  /*!< [3..3] ULPTEVI edge polarity select                                       */
            uint8_t              : 1;
            __IOM uint8_t TCK1   : 1;  /*!< [5..5] ULPT count source select                                           */
            uint8_t              : 2;
        } ULPTMR1_b;
    };

    union
    {
        __IOM uint8_t ULPTMR2;         /*!< (@ 0x0000000E) ULPT Mode Register 2                                       */

        struct
        {
            __IOM uint8_t CKS : 3;     /*!< [2..0] fsub/LOCO count source clock frequency division ratio
                                        *   select                                                                    */
            uint8_t           : 4;
            __IOM uint8_t LPM : 1;     /*!< [7..7] ULPT Low Power Mode                                                */
        } ULPTMR2_b;
    };

    union
    {
        __IOM uint8_t ULPTMR3;         /*!< (@ 0x0000000F) ULPT Mode Register 3                                       */

